cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/versions'
tap 'puma/puma'

# Install prerequisite dependencies
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'openssl'
brew 'readline'
brew 'gpg'

brew 'ack'
brew 'fd'
brew 'jp2a'
brew 'jq'
brew 'libgit2'
brew 'imagemagick'
brew 'node'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'mackup'
brew 'yarn'
brew 'youtube-dl'
brew 'watchman'
brew 'zplug'
brew 'fzf'
brew 'git'
brew 'git-extras'
brew 'python'
brew 'tree'
brew 'wifi-password'
brew 'TomAnthony/brews/itermocil'
brew 'source-highlight'
brew 'brew-cask-completion'
brew 'plex-media-server'

# Install Apps
cask 'alfred'
cask 'dashlane'
cask 'appcleaner'
cask 'browser-chooserx'
cask 'dash'
cask 'google-backup-and-sync'
cask 'iterm2'
cask 'macdown'
cask 'firefox'
cask 'fluid'
cask 'google-chrome'
cask 'kap'
cask 'moom'
cask 'transmission'
cask 'rocket'
cask 'paw'
cask 'rdm'
cask 'rowanj-gitx'
cask 'sketch'
cask 'slack'
cask 'spotify'
cask 'sourcetree'
cask 'github-desktop'
cask 'visual-studio-code'
cask 'the-unarchiver'
cask 'nordvpn'
cask 'utc-menu-clock'
cask 'vlc'
cask 'whatsapp'
cask 'abstract'

# App Store
mas 'Amphetamine', id: 937984704
mas 'Paste', id: 967805235
mas 'Postico', id: 1031280567
mas 'Twitter', id: 409789998
mas 'Wunderlist', id: 410628904
mas 'BetterSnapTool', id: 417375580
