cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/versions'
tap 'puma/puma'

# Install prerequisite dependencies
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'openssl'
brew 'readline'
brew 'gpg'

brew 'zsh'
brew 'ack'
brew 'fd'
brew 'jp2a'
brew 'jq'
brew 'libgit2'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'watchman'
brew 'git'
brew 'git-extras'
brew 'python'
brew 'tree'
brew 'wifi-password'
brew 'highlight'
brew 'brew-cask-completion'

# Install Apps
cask '1password'
cask 'appcleaner'
cask 'dash'
cask 'iterm2'
cask 'google-chrome'
cask 'kap'
cask 'moom'
cask 'rocket'
cask 'slack'
cask 'spotify'
cask 'github-desktop'
cask 'visual-studio-code'
cask 'the-unarchiver'
cask 'vlc'
cask 'whatsapp'
cask 'muzzle'

# App Store
mas 'Amphetamine', id: 937984704
